{"id":"1","title":"The Search for Information and the Net Generation","format":"C","year":"2007","author1":"Combes","role1":"Lecturer","affiliation1":"Edith Cowan University","author2":null,"role2":null,"affiliation2":null,"author3":null,"role3":null,"affiliation3":null,"author4":null,"role4":null,"affiliation4":null,"author5":null,"role5":null,"affiliation5":null,"country":"Australia","conference":"International Association of School Librarianship","location":"Taipei","method1":"Surveys","method2":"Interviews","method3":"Quantitative","source":"http:\/\/search.proquest.com\/docview\/236035428\/abstract?accountid=14474","abstract":"Supporters of the Net Generation theory claim that children born after 1985 have an in-depth grasp and almost ’intuitive’ knowledge of how to use technology, simply because they have never known a world without the Internet and technological change. This theory contradicts traditional information theory which contends that information-seeking behaviour is a complex activity that is affected by cultural, educational and social contexts. Anecdotal evidence from schools and public libraries has long suggested that while young people actively use technology, they do not use it as described by the Net generation theorists. In recent years there has been an emerging body of research on the Net Generation that largely debunks the myth of an intuitive user who is capable of using electronic resources to find information, a fact many teacher librarians have long suspected. This paper explores the initial findings of research into the information-seeking behaviour of young adults and how they use a range of technologies and electronic resources. [PUBLICATION ABSTRACT]","class1":"Information Seeking","class2":null,"class3":null}{"id":"2","title":"Wikis in School Libraries","format":"C","year":"2007","author1":"Dukic","role1":"Librarian","affiliation1":"Kowloon Junior School","author2":null,"role2":null,"affiliation2":null,"author3":null,"role3":null,"affiliation3":null,"author4":null,"role4":null,"affiliation4":null,"author5":null,"role5":null,"affiliation5":null,"country":"Hong Kong","conference":"International Association of School Librarianship","location":"Taipei","method1":"Review","method2":null,"method3":"Qualitative","source":"http:\/\/search.proquest.com\/docview\/236045077\/abstract?accountid=14474","abstract":"The Web 2.0 thinking and accompanying technologies opened a new direction of development for libraries. Among different Web 2.0 applications wikis are particularly attractive for school librarians. Wikis are read-write web pages that are easy to use, accommodate other Web 2.0 features and are widely applicable for a number of purposes. A Wiki space named LibraryZone is a good example of using wiki in elementary school library. LibraryZone is used for information literacy instructions, conducting a collaborative project, for story writing and as a discussion space.","class1":"Information Technology","class2":null,"class3":null}